Repository: MetaModels/filter_range
Catalog: src/Resources/translations/*_metamodel_filtersetting.*.xlf
Languages: de

# typenames.range
source: Value within 2 atributes
de: Wert von/bis für zwei Attribute

# typenames.rangedate
source: Value within 2 atributes for date
de: Wert von/bis für zwei Datums-Attribute

# moreequal.label
source: Value 1 included
de: Wert 1 einbeziehen

# moreequal.description
source: Include first value in comparison; Standard: excluded.
de: Den ersten Wert in den Vergleich einbeziehen; Standard: ausgeschlossen.

# lessequal.label
source: Value 2 included
de: Wert 2 einbeziehen

# lessequal.description
source: Include second value in comparison; Standard: excluded.
de: Den zweiten Wert in den Vergleich einbeziehen; Standard: ausgeschlossen.

# fromfield.label
source: Field for value 1
de: Feld für Wert 1

# fromfield.description
source: Show FE field for value no 1.
de: Zeige Frontend-Feld für Wert 1.

# tofield.label
source: Field for value 2
de: Feld für Wert 2

# tofield.description
source: Show FE field for value no 2.
de: Zeige Frontend-Feld für Wert 2.

# attr_id2.label
source: Second attribute
de: Zweites Attribut

# attr_id2.description
source: Second attribute this setting relates to.
de: Das Zweite Attribut auf das sich die Einstellung bezieht.

# timetype.label
source: Schema for date or time
de: Schema für Datum oder Zeit

# timetype.description
source: Here you can select the desired scheme for date or time.
de: Hier können Sie das gewünschte Schema für Datum oder Zeit auswählen.

# placeholder.label
source: Placeholder
de: Platzhalter

# placeholder.description
source: Show this text as long as the field is empty.
de: Zeigen Sie diesen Platzhaltertext an, solange das Feld leer ist.

# filterrange_type.label
source: Type of filtering
de: Filtertyp

# filterrange_type.description
source: Here you can select the type of filtering.
de: Hier können Sie den Typ der Filterung auswählen.

# timetypeOptions.time
source: Time
de: Zeit

# timetypeOptions.date
source: Date
de: Datum

# timetypeOptions.datim
source: Date and time
de: Datum und Uhrzeit

# filterrangetypeOptions.s1
source: Both values must be in the range. (S1)
de: Beide Werte müssen in dem Bereich sein. (S1)

# filterrangetypeOptions.s2
source: The second value must be in the range. (S2)
de: Der zweite Wert muss in dem Bereich sein. (S2)

# filterrangetypeOptions.s3
source: The first value must be in the range. (S3)
de: Der erste Wert muss in dem Bereich sein. (S3)

# filterrangetypeOptions.s4
source: The first or the second value must be in the range. (S4)
de: Der erste oder der zweite Wert muss in dem Bereich sein. (S4)

# filterrangetypeOptions.s5
source: The range must be between the first and second value. (S5)
de: Der Bereich muss zwischen dem ersten und dem zweiten Wert liegen. (S5)

# filterrange_type_db.caption
source: Type of filter range options
de: Typ der Filterbereichs-Option

# filterrange_type_db.description
source: The filter range has several options on how to handle the comparison between the containment values and the filter values.<br /> As an example, the following values in the database:<br /> the data of attribute 1 (=15) and 2 (=20) and an example at every option to find an hit. <pre>DB: ---------15---------20-----</pre>
de: Für den Filterbereich gibt es mehrere Optionen, wie der Vergleich zwischen den Eingrenzungswerten und den Filterwerten gehandhabt werden soll.<br /> Als Beispiel sind folgende Werte in der Datenbank:<br /> die Daten der Attribute 1 (=15) und 2 (=20) und ein Beispiel bei jeder Option, um einen Treffer zu finden. <pre>DB: ---------15---------20-----</pre>

# filterrange_type_s1.caption
source: S1<br />Both values must be in the range.
de: S1<br />Beide Werte müssen in dem Bereich sein.

# filterrange_type_s2.caption
source: S2<br />The second value must be in the range.
de: S2<br />Der zweite Wert muss in dem Bereich sein.

# filterrange_type_s2.description
source: The first value must be smaller than the right limit of the range, but can also be smaller than the left limit - the second value must be in the range. <pre>S2: ------13----------18-------</pre>
de: Der erste Wert muss kleiner als die rechte Grenze des Bereichs sein, kann aber auch kleiner als die linke Grenze sein - der zweite Wert muss innerhalb des Bereichs liegen. <pre>S2: ------13----------18-------</pre>

# filterrange_type_s3.caption
source: S3<br />The first value must be in the range.
de: S3<br />Der erste Wert muss in dem Bereich sein.

# filterrange_type_s3.description
source: The second value must be greater than the left limit of the range, but can also be greater than the right limit - the first value must be in the range. <pre>S3: -----------16----------22--<pre>
de: Der zweite Wert muss größer sein als die linke Grenze des Bereichs, kann aber auch größer sein als die rechte Grenze - der erste Wert muss innerhalb des Bereichs liegen. <pre>S3: -----------16----------22--<pre>

# filterrange_type_s4.caption
source: S4<br />The first or the second value must be in the range.
de: S4<br />Der erste oder der zweite Wert muss in dem Bereich sein.

# filterrange_type_s4.description
source: At least one value must be within the range - this is a combination of option "S2" and "S3". <pre>S2: ------13----------18-------</pre> <pre>S3: -----------16----------22--<pre>
de: Mindestens ein Wert muss innerhalb des Bereichs liegen - dies ist eine Kombination der Optionen "S2" und "S3". <pre>S2: ------13----------18-------</pre> <pre>S3: -----------16----------22--<pre>

# filterrange_type_s5.caption
source: S5<br />The range must be between the first and second value.
de: S5<br />Der Bereich muss zwischen dem ersten und dem zweiten Wert liegen.

# filterrange_type_s5.description
source: The first value must be smaller and the second value must be larger than the range - this is option "S1" inverted. <pre>S5: ------13---------------22--<pre>
de: Der erste Wert muss kleiner und der zweite Wert muss größer als der Bereich sein - dies ist die umgekehrte Option "S1". <pre>S5: ------13---------------22--<pre>
